mazent/STM32/Lib/cmsis_rtos/cmsis_os_freertos.c
        if ( xQueueReceiveFromISR(queue_id->spedite, &event.value.p,
                                  &xHigherPriorityTaskWoken) == pdTRUE ) {
            event.status = osEventMail ;
        }
        else {
            event.status = osOK ;
        }

        portYIELD_FROM_ISR(xHigherPriorityTaskWoken) ;
    }
    else {
        TickType_t attesa = ms_in_tick(millisec) ;

        event.status = pdTRUE ==
                       xQueueReceive(queue_id->spedite,
                                     &event.value.p, attesa) ?
                       osEventMail : osOK ;
    }

    return event ;
}

#endif  // Mail Queues available

/*********************************************
    Non fanno parte dell'interfaccia
    ma dipendono da freertos
*********************************************/

extern void xPortSysTickHandler(void) ;

void SysTick_Handler(void)
{
    HAL_IncTick() ;

#if INCLUDE_xTaskGetSchedulerState == 1
    if ( xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED ) {
        xPortSysTickHandler() ;
    }
#else
#   error INCLUDE_xTaskGetSchedulerState deve valere 1
#endif
}


#if configAPPLICATION_ALLOCATED_HEAP == 1
// Lo stack tcp/ip usa
//     xPortGetMinimumEverFreeHeapSize
//     xPortGetFreeHeapSize
// che heap_3.c non ha
// Lo metto dove voglio io
USED
__attribute__( ( section(".heap_x") ) )
uint8_t ucHeap[configTOTAL_HEAP_SIZE] ;
#endif


#if configCHECK_FOR_STACK_OVERFLOW > 0

void vApplicationStackOverflowHook(
    TaskHandle_t xTask,
    char * pcTaskName)
{
    INUTILE(xTask) ;

    DBG_PRINTF("STACK OVERFLOW HOOK: %s \r\n", pcTaskName) ;

    BPOINT ;
}

#endif

#if configUSE_MALLOC_FAILED_HOOK == 1

void vApplicationMallocFailedHook(void)
{
    DBG_PUTS("MALLOC FAILED HOOK") ;

    BPOINT ;
}

#endif

#if configUSE_TICK_HOOK == 1

void vApplicationTickHook(void)
{}

#endif

#ifndef NDEBUG

#   ifdef traceMALLOC
void trace_malloc(
    void * p,
    size_t dim)
{
    ASSERT(p) ;

    DBG_PRINTF("%p = malloc(%zu)\n", p, dim) ;
}

#   endif

#   ifdef traceFREE
void trace_free(
    void * p,
    size_t dim)
{
    INUTILE(dim) ;

    DBG_PRINTF("free(%p)\n", p) ;
}

#   endif

#endif
